{"files":{},"open-pages":["index.html","http://localhost:3000/","http://localhost:3000/category/acting-classes-coaches"],"ai-project-brief":"Child Actor 101 Directory, a curated directory connecting families with vetted entertainment professionals specializing in youth acting. Warm, family-focused Bauhaus-inspired mid-century modern Hollywood design that balances approachable, trust-building warmth with geometric discipline, strong grid alignment, card-based layouts, subtle Hollywood accents, and high-contrast accessibility. Features a Bauhaus Mid-Century Modern Hollywood palette — Cinema Backdrop Navy (#0C1A2B) and Deep Charcoal (#1E1F23) for backgrounds, Soft Cream (#FFFDD0) and Cream Ink (#1B1F29) for cards and text, accented by Muted Mustard (#D4A574), Faded Red-Orange (#CC5A47), and Robin's Egg Blue (#7AB8CC) — with bold display headings (movie-poster style) and a simple sans-serif body for readability. Mobile-first, responsive design using a strict Bauhaus grid and component system, optimized for performance and WCAG 2.1 AA accessibility across all devices. IMPORTANT: All section background images will use creative means (dimmed background, text boxes, effects...) to ensure optimal text visibility and readability. Furthermore, the website's visual identity will exclusively use imagery related to the film industry and youth acting, including child actor headshots and portfolio images, on-set rehearsal and audition scenes with young performers, acting coaches and photographers working with children, studio and casting-room environments, and family support at auditions, ensuring a cohesive and authentic brand experience that builds trust, communicates safety and professionalism, and resonates with families and industry professionals.","urls":{"http://localhost:3000/":{"open-with-wrapper":false},"http://localhost:3000/category/acting-classes-coaches":{"open-with-wrapper":false}},"remote-urls":["http://localhost:3000/category/acting-classes-coaches","http://localhost:3000/"],"active-design-provider":"plainhtml"}